Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--cesium_overview.tmx
Source language: en
Languages: ja

source: 3D Globes and 2D Maps in a Browser
ja: ブラウザ上の3次元地球儀と2次元地図

source: Cesium is a JavaScript library for creating 3D globes and 2D maps in a web browser without any plugins. It uses WebGL for hardware-accelerated graphics, and is cross-platform, cross-browser, and tuned for dynamic-data visualization.
ja: Cesiumは、プラグインなしでウェブブラウザで3D地球儀と2Dマップを作成するためのJavaScriptライブラリです。ハードウェアで高速化されたグラフィックスにWebGLを使用し、クロスプラットフォーム、クロスブラウザで、動的データの視覚化に合わせて調整されています。

source: Core Features
ja: 主要機能

source: Dynamic Geospatial Visualization:
ja: 動的な地理空間視覚化:

source: Create data-driven, time-dynamic scenes with `CZML <https://github.com/CesiumGS/cesium/wiki/CZML-Guide>`_.
ja: `CZML<https://github.com/CesiumGS/cesium/wiki/CZML-Guide>`_を使用して、データ駆動型で時間動的なシーンを作成します。

source: Visualize high-resolution worldwide terrain.
ja: 世界的な地形を高解像度で可視化します。

source: Draw imagery layers using WMS, TMS, OpenStreetMaps, Bing, and Esri standards.
ja: WMS、TMS、OpenStreetMaps、Bing、およびEsri標準を使用して画像レイヤを描画します。

source: Draw vector data from GeoJSON and TopoJSON.
ja: GeoJSONとTopoJSONからベクタデータを描画します。

source: Draw 3D models using COLLADA and glTF.
ja: COLLADAとglTFを使用して3Dモデルを描画します。

source: Use `plugins <https://cesium.com/cesiumjs>`_ to extend Cesium.
ja: `プラグイン<https://cesium.com/cesiumjs>`_を使用してCesiumを拡張します。

source: Built for Performance and Precision:
ja: パフォーマンスと精度を重視した設計:

source: Optimized WebGL with batching and culling efficiently uses hardware-accelerated graphics.
ja: バッチとカリングに最適化されたWebGLにより、ハードウェアで高速化されたグラフィックスを効率的に使用します。

source: Draw a wide range of geometries including polylines, polygons, billboards, labels, extrusions, and corridors.
ja: ポリライン、ポリゴン、ビルボード、ラベル、押し出し、コリドーなど、さまざまなジオメトリを描画します。

source: Use `3D Tiles <https://cesium.com/blog/2017/07/12/the-next-generation-of-3d-tiles/>`_ to stream, style and interact with heterogeneous 3D data, including photogrammetry models, 3D buildings, CAD and BIM exterior and interiors, and point clouds.
ja: `3Dタイル<https://cesium.com/blog/2017/07/12/the-next-generation-of-3d-tiles/>`_を使用して、写真測量モデル、3D建物、CADとBIMの外部と内部、ポイントクラウドなど、異種の3Dデータをストリーミング、スタイル設定、および操作します。

source: Control the camera and create flight paths.
ja: カメラを制御して飛行経路を作成します。

source: Use standard widgets to control animation time, select imagery layers, and zoom to a location.
ja: 標準ウィジェットを使用して、アニメーション時間を制御したり、画像レイヤを選択したり、場所にズームしたりします。

source: One API, Three Views:
ja: 1つのAPI、3つのビュー:

source: Cesium supports a 3D globe, 2D map, and 2.5D Columbus View with the same API.
ja: Cesium は同じAPIで3D地球儀、2Dマップ、2.5Dコロンブスビューをサポートしています。

source: Implemented Standards
ja: 実装されている標準規格

source: WMS and WMTS
ja: WMSとWMTS

source: Details
ja: 詳細

source: **Website:** https://cesium.com/
ja: **Webサイト:** https://cesium.com/

source: **Licence:** Apache 2.0 license
ja: **ライセンス:** Apache 2.0 license

source: **Software Version:** |version-cesium|
ja: **ソフトウェアバージョン:** |version-cesium|

source: **Supported Platforms:** Platform independent, depends only on a browser which supports WebGL
ja: **対応プラットフォーム:** Platform independent, depends only on a browser which supports WebGL

source: **Community Support:** Forum at https://groups.google.com/forum/?hl=en#!forum/cesium-dev
ja: **コミュニティサポート:** Forum at https://groups.google.com/forum/?hl=en#!forum/cesium-dev

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/cesium_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/cesium_quickstart>`
